app/controllers/accounts_controller.rb

  def index
    @account=Account.find_by_user_id(current_user.id)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1

  def new
    if !Account.exists?(:user_id => current_user.id)
---
SELECT 1 AS one FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1

  def edit
     @account=Account.find_by_user_id(current_user.id)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1

  def create
   @account = Account.new(account_params)

   if !Account.exists?(:user_id=>current_user.id)
     if path=Account.save_file(account_params)
---
SELECT 1 AS one FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1
INSERT INTO "accounts" ("comment", "created_at", "script_name", "script_url", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "accounts" SET "tokens" = $1, "updated_at" = $2 WHERE "accounts"."id" = 66  [["tokens", [[3, 10]]], ["updated_at", Fri, 30 Aug 2013 10:01:02 UTC +00:00]]

  def update
    @account.update(account_params)
---
UPDATE "accounts" SET "script_name" = $1, "comment" = $2, "updated_at" = $3 WHERE "accounts"."id" = 67  [["script_name", "my script"], ["comment", "comment "], ["updated_at", Fri, 30 Aug 2013 11:44:25 UTC +00:00]]

  def destroy
    Account.destoy_file(@account)
    @account.script_name = nil
    @account.script_url = nil
    @account.save
---
UPDATE "accounts" SET "script_name" = $1, "script_url" = $2, "updated_at" = $3 WHERE "accounts"."id" = 67  [["script_name", nil], ["script_url", nil], ["updated_at", Fri, 30 Aug 2013 10:08:19 UTC +00:00]]

    def set_account
        if Account.find_by_user_id(current_user.id)== nil
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1