app/controllers/addresses_controller.rb

  def edit
    @address=Address.find_by_user_id(current_user.id)
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = 15 LIMIT 1