app/controllers/jobs_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1
---
  def index
    @jobs = Job.all.where('user_id=?',current_user.id)
    account=Account.find_by_user_id(current_user.id)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1
---
  def new
    @job = Job.new
    @token_arr=[]
    get_user_tokens
    account=Account.find_by_user_id(current_user.id)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1
SELECT "tokens".* FROM "tokens" WHERE "tokens"."id" = 3 LIMIT 1
---
  def user_tokens
    account=Account.find_by_user_id(current_user.id)
    if account !=nil && account.tokens !=nil
       @cur_tokens=[]
     account.tokens.each do |t|
       tok=Token.find_by_id(t[0])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 15 LIMIT 1
---
    def set_job
      account=Account.find_by_user_id(current_user.id)