app/controllers/tokens_controller.rb

SELECT "tokens".* FROM "tokens"
---
  def index
    @tokens = Token.all

SELECT "tokens".* FROM "tokens" WHERE "tokens"."id" = $1 LIMIT 1  [["id", "6"]]
---
    def set_token
      @token = Token.find(params[:id])