app/controllers/users_controller.rb

   def index
     @support=Support.new(:id=>1)
    @users = User.all
---
SELECT "users".* FROM "users"

  def view
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "13"]]